app/views/users/_unfollow.html.erb

<%= form_for(current_user.active_relationships.find_by(followed_id: @user.id),
<<<<<<< HEAD
=======
<<<<<<< HEAD
=======
<<<<<<< HEAD
>>>>>>> 148c8d617f3eacbd8be20c89085e047a789f2aed
>>>>>>> e6fdcabef359d177e94501ea741c7c28e5452f97
             html: { method: :delete },
=======
             html: { method: :delete }) do |f| %>
---
INSERT INTO "relationships" ("followed_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followed_id", 2], ["follower_id", 1], ["created_at", "2017-05-09 04:36:56.660601"], ["updated_at", "2017-05-09 04:36:56.660601"]]