app/controllers/users_controller.rb

  def index
   ###@users = User.where(activated: true).paginate(page: params[:page])
   @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"